---
kind: property
id: P:Autodesk.Revit.DB.Path3d.AllCurveLoops
source: html/ab1f3072-74d2-3315-e421-ad617b296e93.htm
---
# Autodesk.Revit.DB.Path3d.AllCurveLoops Property

Get all the Curve Loops of Path3d.

## Syntax (C#)
```csharp
public CurveArrArray AllCurveLoops { get; }
```

## Remarks
Returns all the Curve Loops of Path3d.